Autodesk.Revit.DB.RevolvedFace.Curve
Profile curve of the surface.

Autodesk.Revit.DB.RevolvedFace.Radius(System.Int32)
Radius of the surface.

Autodesk.Revit.DB.RevolvedFace.Axis
Axis of the surface.

Autodesk.Revit.DB.RevolvedFace.Origin
Origin of the surface.

Autodesk.Revit.DB.RevolvedFace
A revolved face of a 3d solid or open shell.
Remarks: Revolved faces are defined by a profile curve and a local coordinate system.
For details on the parameterization, refer to the documentation for Autodesk.Revit.DB.RevolvedSurface